## 사업보고서 - 직원 현황 : 여러 회사(상장기업)
+ 작성: 임경호
+ 금융감독원 OPEN DART https://opendart.fss.or.kr/

In [32]:
import requests
import pandas as pd

url = 'https://opendart.fss.or.kr/api/empSttus.json'
api_key = 'f2e08d4ed3de0ba3d5cbf59c04c223e02b1751a2'

listed_corp_codes = \
['01208885',
 '00787376',
 '00128555',
 '00130684']

# report code
# 1분기보고서 : 11013
# 반기보고서 : 11012
# 3분기보고서 : 11014
# 사업보고서 : 11011

df_all = pd.DataFrame()

for corp_code in listed_corp_codes:
    params = {
        'corp_code': corp_code,
        'bsns_year': 2022,
        'reprt_code': 11011,
        'crtfc_key': api_key,
    }
    response = requests.get(url, params=params)
    if response.status_code == 200:     # URL GET '200 정상'
        # data_dict = response.json()
        # r = data_dict['list']
        # print(r)
        df_emp = pd.json_normalize(response.json()['list'])
        df_all = pd.concat([df_all, df_emp])
    else:
        print("URL GET Error", corp_code)

In [33]:
# fo_bbm    사업부문
# rgllbr_co 정규직 수
# cnttk_co  계약직 수
# sm        합계
# avrg_cnwk_sdytrn  평균 근속 연수
# fyer_salary_totamt  연간 급여 총액
# jan_salary_am     1인평균 급여액
df_all

,rcept_no,corp_cls,corp_code,corp_name,sexdstn,fo_bbm,reform_bfe_emp_co_rgllbr,reform_bfe_emp_co_cnttk,reform_bfe_emp_co_etc,rgllbr_co,rgllbr_abacpt_labrr_co,cnttk_co,cnttk_abacpt_labrr_co,sm,avrg_cnwk_sdytrn,fyer_salary_totamt,jan_salary_am,rm
0,20230314001158,Y,01208885,경동도시가스,남,도시가스,-,-,-,243,-,28,-,271,18년 1개월,"26,255,973,000","96,886,000",-
1,20230314001158,Y,01208885,경동도시가스,여,도시가스,-,-,-,19,-,5,-,24,15년 6개월,"1,951,041,000","81,293,000",-
0,20230321000870,Y,00787376,대성에너지,남,도시가스,-,-,-,366,-,10,-,376,19년 4개월,"31,746,000,000","84,000,000",-
1,20230321000870,Y,00787376,대성에너지,여,도시가스,-,-,-,30,-,-,-,30,14년 1개월,"1,878,000,000","63,000,000",-
0,20230316001421,Y,00128555,삼천리,남,도시가스,-,-,-,553,-,9,-,562,18년 1개월,"51,985,000,000","93,000,000",-
1,20230316001421,Y,00128555,삼천리,여,도시가스,-,-,-,43,-,-,-,43,22년 5개월,"3,193,000,000","74,000,000",-
2,20230316001421,Y,00128555,삼천리,남,기타,-,-,-,195,-,3,-,198,11년 8개월,"22,286,000,000","113,000,000",-
3,20230316001421,Y,00128555,삼천리,여,기타,-,-,-,44,-,-,-,44,8년 10개월,"3,337,000,000","76,000,000",-
0,20230315000963,Y,00130684,서울도시가스,남,도시가스공급,-,-,-,469,0,8,0,477,22.8,"49,371,000,000","106,000,000",-
1,20230315000963,Y,00130684,서울도시가스,여,도시가스공급,-,-,-,33,0,5,0,38,17.3,"2,506,000,000","68,000,000",-

In [34]:
df_all[['corp_code', 'corp_name', 'fo_bbm', 'sexdstn', 'sm', 'rgllbr_co', 'cnttk_co', 'avrg_cnwk_sdytrn']]

  corp_code corp_name  fo_bbm sexdstn   sm rgllbr_co cnttk_co avrg_cnwk_sdytrn
0  01208885    경동도시가스    도시가스       남  271       243       28          18년 1개월
1  01208885    경동도시가스    도시가스       여   24        19        5          15년 6개월
0  00787376     대성에너지    도시가스       남  376       366       10          19년 4개월
1  00787376     대성에너지    도시가스       여   30        30        -          14년 1개월
0  00128555       삼천리    도시가스       남  562       553        9          18년 1개월
1  00128555       삼천리    도시가스       여   43        43        -          22년 5개월
2  00128555       삼천리      기타       남  198       195        3          11년 8개월
3  00128555       삼천리      기타       여   44        44        -          8년 10개월
0  00130684    서울도시가스  도시가스공급       남  477       469        8             22.8
1  00130684    서울도시가스  도시가스공급       여   38        33        5             17.3

In [35]:
df_all['cnttk_co'].replace({'-': '0'}, inplace=True)
df_all['rgllbr_co'].replace({'-': '0'}, inplace=True)
df_all['sm'].replace({'-': '0'}, inplace=True)

In [36]:
corp_employee = df_all.astype({'sm' : 'int',                               
                               'rgllbr_co' : 'int',
                               'cnttk_co' : 'int'})
corp_employee[['corp_code', 'corp_name', 'fo_bbm', 'sexdstn', 'sm', 'rgllbr_co', 'cnttk_co', 'avrg_cnwk_sdytrn']]

,corp_code,corp_name,fo_bbm,sexdstn,sm,rgllbr_co,cnttk_co,avrg_cnwk_sdytrn
0,01208885,경동도시가스,도시가스,남,271,243,28,18년 1개월
1,01208885,경동도시가스,도시가스,여,24,19,5,15년 6개월
0,00787376,대성에너지,도시가스,남,376,366,10,19년 4개월
1,00787376,대성에너지,도시가스,여,30,30,0,14년 1개월
0,00128555,삼천리,도시가스,남,562,553,9,18년 1개월
1,00128555,삼천리,도시가스,여,43,43,0,22년 5개월
2,00128555,삼천리,기타,남,198,195,3,11년 8개월
3,00128555,삼천리,기타,여,44,44,0,8년 10개월
0,00130684,서울도시가스,도시가스공급,남,477,469,8,22.8
1,00130684,서울도시가스,도시가스공급,여,38,33,5,17.3

In [37]:
corp_employee.groupby(['corp_code', 'corp_name']).agg(sm = ('sm', 'sum'),
                                                      rgllbr_co = ('rgllbr_co', 'sum'),
                                                      cnttk_co = ('cnttk_co', 'sum'))

                      sm  rgllbr_co  cnttk_co
corp_code corp_name
00128555  삼천리        847        835        12
00130684  서울도시가스     515        502        13
00787376  대성에너지      406        396        10
01208885  경동도시가스     295        262        33